# Introduction to Numpy and Pandas

## numpy

In [1]:
import numpy as np
arr = np.array([11,22,33])  # 1D
arr

array([11, 22, 33])

In [2]:
type(arr)

numpy.ndarray

In [4]:
# 2D array
list_data = [[11, 22, 33], [44,55,66]]
arr = np.array(list_data)
arr

array([[11, 22, 33],
       [44, 55, 66]])

In [5]:
type(arr)

numpy.ndarray

In [6]:
arr.shape  #(rows, columns)

(2, 3)

In [8]:
# list
list(range(10,20,2))

[10, 12, 14, 16, 18]

In [10]:
# generate an array
np.arange(10,20,2)  # arange(start, stop, step)

array([10, 12, 14, 16, 18])

In [11]:
np.zeros(4)

array([0., 0., 0., 0.])

In [12]:
np.zeros((3,4))  # zeros(shape)

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.]])

In [14]:
# linearly/equally spaced vector (start,stop, no_of_values)
# returns number of values between start and stop including both start and stop
vector = np.linspace(0,25,4)
vector

array([ 0.        ,  8.33333333, 16.66666667, 25.        ])

In [15]:
vector = np.linspace(0,20,4)
vector

array([ 0.        ,  6.66666667, 13.33333333, 20.        ])

In [17]:
vector = np.linspace(0,20,5)
vector

array([ 0.,  5., 10., 15., 20.])

In [18]:
# how to find the data type of an array
# arr.dtype
vector.dtype

dtype('float64')

In [23]:
# reshaping of an array
arr_1d = np.zeros(8)
print(arr_1d)
arr_3d = arr_1d.reshape((2,2,2))
print(arr_3d)

[0. 0. 0. 0. 0. 0. 0. 0.]
[[[0. 0.]
  [0. 0.]]

 [[0. 0.]
  [0. 0.]]]

In [25]:
arr_1d = np.zeros(8)
print(arr_1d)
print("#"*20)
arr_2d = arr_1d.reshape((2,4))
print(arr_2d)

[0. 0. 0. 0. 0. 0. 0. 0.]
####################
[[0. 0. 0. 0.]
 [0. 0. 0. 0.]]

In [26]:
# flatten the array
print(arr_2d)
print("*"*20)
arr_1d = arr_2d.ravel()
print(arr_1d)

[[0. 0. 0. 0.]
 [0. 0. 0. 0.]]
********************
[0. 0. 0. 0. 0. 0. 0. 0.]

In [28]:
# 3D to 2D
# reshaping of an array
arr_1d = np.zeros(8)
print(arr_1d)
arr_3d = arr_1d.reshape((2,2,2))
print(arr_3d)

arr_2d = arr_3d.reshape((4,2))
print("#######")
print(arr_2d)

[0. 0. 0. 0. 0. 0. 0. 0.]
[[[0. 0.]
  [0. 0.]]

 [[0. 0.]
  [0. 0.]]]
#######
[[0. 0.]
 [0. 0.]
 [0. 0.]
 [0. 0.]]

### Indexing and Slicing

In [29]:
arr = np.array([11,22, 33, 44, 55, 66, 77, 88, 99])
arr

array([11, 22, 33, 44, 55, 66, 77, 88, 99])

In [30]:
arr[2]

33

In [31]:
arr[1:7]  # 1 to 6

array([22, 33, 44, 55, 66, 77])

In [32]:
arr[:3]

array([11, 22, 33])

In [33]:
arr = np.array([11,22, 33, 44, 55, 66, 77, 88, 99])
slice_obj = slice(1,10,2)
arr[slice_obj]

array([22, 44, 66, 88])

In [35]:
# accessing multiple values together
list_of_indexes = [1,2,3]
arr[list_of_indexes]

array([22, 33, 44])

In [36]:
arr[[3,4,6]]

array([44, 55, 77])

### slicing 2D array

In [37]:
arr = np.array([[11,22,33,44],[55, 66, 77, 88], [1, 2, 3, 4], [100, 200, 300, 400]])
arr

array([[ 11,  22,  33,  44],
       [ 55,  66,  77,  88],
       [  1,   2,   3,   4],
       [100, 200, 300, 400]])

In [38]:
#syntax: arr[row_slice, colum_slice]
arr[0:3,0:2]

array([[11, 22],
       [55, 66],
       [ 1,  2]])

In [39]:
arr[0:3,0:3]

array([[11, 22, 33],
       [55, 66, 77],
       [ 1,  2,  3]])

In [40]:
arr = np.array([11,22, 33, 44, 55, 66, 77, 88, 99])
arr

array([11, 22, 33, 44, 55, 66, 77, 88, 99])

In [44]:
# slicing using negative indexes
arr[-1:-10:-3] # arr[1], arr[4], arr[7]

array([99, 66, 33])

## array attributes

In [47]:
arr = np.array([11, 22, 33])
print(arr.dtype)

int64

In [48]:
# choosing the dtype
arr = np.array([11, 22, 33], dtype=np.int8)
print(arr)
print(arr.dtype)

[11 22 33]
int8

In [49]:
# choosing the dtype
arr = np.array([11, 22, 33], dtype=np.float16)
print(arr)
print(arr.dtype)

[11. 22. 33.]
float16

In [52]:
arr = np.array([[2,3, 4], [4,5, 6]])
# shape
arr.shape

(2, 3)

In [53]:
# dimensions
arr.ndim

2

In [56]:
# size of each element
arr.itemsize

8

In [55]:
arr.dtype

dtype('int64')

### empty array

In [64]:
arr = np.empty([3,4])
arr  # returns a random value array or uninitialsed array
# most of the time elements would be 0 but not necessarily.

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.]])

## Reading and Writing from text files

In [70]:
# reading a text file and loading it in array
arr = np.loadtxt('filex.txt', dtype=np.int8)
arr

array([[ 1,  2,  3,  4,  5,  6,  7],
       [ 8,  3,  4,  5,  5,  1,  8],
       [ 6,  3,  4,  5,  5,  1,  8],
       [ 6,  3,  4,  5,  5,  1,  8],
       [ 4,  3,  4,  5,  5,  1, 10]], dtype=int8)

In [79]:
# export an array to a text file
# 'd' for numbers
np.savetxt('out_integers.txt', arr,fmt="%d")

In [80]:
# float value 'f' upto 2 decimal level
np.savetxt('out_float.txt', arr,fmt="%.2f")

### exporting to CSV file, add delimiter=','

In [81]:
np.savetxt('out_int.csv', arr,fmt="%d", delimiter=',')

In [82]:
np.savetxt('out_dollar.txt', arr,fmt="%d", delimiter='$')

In [84]:
# loading data from CSV file
# 1. np.genfromtxt()
arr = np.genfromtxt('out_int.csv', delimiter=',')
arr

array([[ 1.,  2.,  3.,  4.,  5.,  6.,  7.],
       [ 8.,  3.,  4.,  5.,  5.,  1.,  8.],
       [ 6.,  3.,  4.,  5.,  5.,  1.,  8.],
       [ 6.,  3.,  4.,  5.,  5.,  1.,  8.],
       [ 4.,  3.,  4.,  5.,  5.,  1., 10.]])

In [85]:
# loading data from CSV file
# 2. np.loadtxt()
arr = np.loadtxt('out_int.csv', delimiter=',')
arr

array([[ 1.,  2.,  3.,  4.,  5.,  6.,  7.],
       [ 8.,  3.,  4.,  5.,  5.,  1.,  8.],
       [ 6.,  3.,  4.,  5.,  5.,  1.,  8.],
       [ 6.,  3.,  4.,  5.,  5.,  1.,  8.],
       [ 4.,  3.,  4.,  5.,  5.,  1., 10.]])

# pandas

In [86]:
import pandas as pd
#1 using list
data = [11, 22, 33, 44]
ser = pd.Series(data)
ser

0    11
1    22
2    33
3    44
dtype: int64

In [87]:
type(ser)

pandas.core.series.Series

In [88]:
pd.Series()  # empty series

Series([], dtype: float64)

In [89]:
# 2. using array
arr = np.array([100, 200, 300, 400])
pd.Series(arr)

0    100
1    200
2    300
3    400
dtype: int64

In [90]:
# choosing the indexes
# using a dict
data = {'a':100, 'b':200, 'c':400}
ser = pd.Series(data)
ser

a    100
b    200
c    400
dtype: int64

In [91]:
ser['a'] # accessing value using index

100

In [94]:
# choosing index by providing list of index names
data = [11, 22, 33]
ser = pd.Series(data, index=['aa', 'bb', 'cc'])
ser

aa    11
bb    22
cc    33
dtype: int64

In [93]:
ser['aa']

11

In [95]:
# slicing
ser = pd.Series([11, 22, 33, 44, 55, 66, 77, 88])
ser[1:5]  #1,2,3,4

1    22
2    33
3    44
4    55
dtype: int64

In [96]:
ser[:3]  # 0,1,2

0    11
1    22
2    33
dtype: int64

In [97]:
ser[4:] # from index 4 till the end

4    55
5    66
6    77
7    88
dtype: int64

## DataFrame

In [98]:
data = [10, 20, 30, 40]
df = pd.DataFrame(data)
df

    0
0  10
1  20
2  30
3  40

In [99]:
# list of dictionaries
data = [{'a':1, 'b':2}, {'a':10, 'b':20, 'c':30}]
df = pd.DataFrame(data)
df

    a   b     c
0   1   2   NaN
1  10  20  30.0

In [100]:
# NaN: not a number

In [101]:
# giving user defined row index 
data = [{'a':1, 'b':2}, {'a':10, 'b':20, 'c':30}]
df = pd.DataFrame(data, index=['first', 'second'])
df

         a   b     c
first    1   2   NaN
second  10  20  30.0

In [102]:
# converting a series into a DataFrame
data = {'one':pd.Series([10,20,30], index=['a', 'b', 'c']),
       'two':pd.Series([10,20,30,40], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

    one  two
a  10.0   10
b  20.0   20
c  30.0   30
d   NaN   40

In [103]:
# column addition
data = {'one':pd.Series([10,20,30], index=['a', 'b', 'c']),
       'two':pd.Series([10,20,30,40], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

    one  two
a  10.0   10
b  20.0   20
c  30.0   30
d   NaN   40

In [104]:
# adding new column
df['srinivas'] = pd.Series([11, 22, 33], index=['a','b', 'c'])
df

    one  two  srinivas
a  10.0   10      11.0
b  20.0   20      22.0
c  30.0   30      33.0
d   NaN   40       NaN

In [105]:
df['gaurav'] = [100, 200, 300, 400]
df

    one  two  srinivas  gaurav
a  10.0   10      11.0     100
b  20.0   20      22.0     200
c  30.0   30      33.0     300
d   NaN   40       NaN     400

In [106]:
# access a column: df[<column_name>]
df['gaurav']

a    100
b    200
c    300
d    400
Name: gaurav, dtype: int64

In [107]:
# deleting a column
# 1. using "del"
del df['one']
df

   two  srinivas  gaurav
a   10      11.0     100
b   20      22.0     200
c   30      33.0     300
d   40       NaN     400

In [112]:
# 2. using pop()
data = {'one':pd.Series([10,20,30], index=['a', 'b', 'c']),
       'two':pd.Series([10,20,30,40], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df
print("deleted column")
print(df.pop('two'))
print("#"*20)
print(df)

deleted column
a    10
b    20
c    30
d    40
Name: two, dtype: int64
####################
    one
a  10.0
b  20.0
c  30.0
d   NaN

## Row selection in a DataFrame
- loc[Row_label]: Row label is the user defined named for rows
- iloc[Row_Position]: Row position is position of row from the top of the dataframe starting from 0.

In [114]:
data = {'one':pd.Series([10,20,30], index=['a', 'b', 'c']),
       'two':pd.Series([10,20,30,40], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

    one  two
a  10.0   10
b  20.0   20
c  30.0   30
d   NaN   40

In [115]:
df.loc['a'] # returns row with the label 'a' ie first row

one    10.0
two    10.0
Name: a, dtype: float64

In [116]:
df.loc['d'] # returns row with the label 'd' i.e last row

one     NaN
two    40.0
Name: d, dtype: float64

In [117]:
# using iloc
df.iloc[0]  # equivalent to -> df.loc['a']

one    10.0
two    10.0
Name: a, dtype: float64

In [118]:
df.iloc[3]  # equivalent to -> df.loc['d']

one     NaN
two    40.0
Name: d, dtype: float64

### Row addition

In [122]:
data = {'one':pd.Series([1,2,3], index=['a', 'b', 'c']),
       'two':pd.Series([10,20,30,40], index=['a', 'b', 'c', 'd']),
       'three':pd.Series([10,20,30], index=['a', 'b', 'c'])}
df1 = pd.DataFrame(data)
df1

   one  two  three
a  1.0   10   10.0
b  2.0   20   20.0
c  3.0   30   30.0
d  NaN   40    NaN

In [123]:
df2 = pd.DataFrame([[11,12], [13,14]], columns=['two', 'three'])
df2

   two  three
0   11     12
1   13     14

In [125]:
# appending the df2 to df1
new_df = df1.append(df2, sort=True)
new_df

   one  three  two
a  1.0   10.0   10
b  2.0   20.0   20
c  3.0   30.0   30
d  NaN    NaN   40
0  NaN   12.0   11
1  NaN   14.0   13

In [127]:
new_df.loc['a']

one       1.0
three    10.0
two      10.0
Name: a, dtype: float64

In [128]:
new_df.loc[0]

one       NaN
three    12.0
two      11.0
Name: 0, dtype: float64

In [129]:
new_df.iloc[0]

one       1.0
three    10.0
two      10.0
Name: a, dtype: float64

In [132]:
new_df.iloc[0]

one       1.0
three    10.0
two      10.0
Name: a, dtype: float64

In [133]:
new_df.iloc[0]['one']

1.0

In [134]:
new_df.iloc[0]['three']

10.0

In [135]:
new_df.iloc[4]

one       NaN
three    12.0
two      11.0
Name: 0, dtype: float64

#### deleting a row
- df.drop(row_label OR row_index)
- drop method can also be used to delete a column syntax: df.drop(column_name, axis=1)

In [137]:
data = {'one':pd.Series([10,20,30], index=['a', 'b', 'c']),
       'two':pd.Series([10,20,30,40], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

    one  two
a  10.0   10
b  20.0   20
c  30.0   30
d   NaN   40

In [139]:
new_df = df.drop('a')  # axis=0 by default
new_df

    one  two
b  20.0   20
c  30.0   30
d   NaN   40

In [140]:
df = df.drop('two', axis=1)
df

    one
a  10.0
b  20.0
c  30.0
d   NaN

## Loading CSVfile to DataFrame

In [144]:
df = pd.read_csv(r'/Users/gyanendrakumar/PycharmProjects/education_DS/Module_5/AllCountries.csv')
df

,Country,LandArea,Population,GDP,Rural,Internet,BirthRate,DeathRate,ElderlyPop,LifeExpectancy,FemaleLabor,Unemployment
0,Afghanistan,652.860,30.552,665.0,74.1,5.9,34.1,7.8,2.3,60.9,16.2,NaN
1,Albania,27.400,2.897,4460.0,44.6,60.1,12.9,6.9,10.7,77.5,51.7,13.4
2,Algeria,2381.740,39.208,5361.0,30.5,16.5,24.3,5.9,4.6,71.0,16.2,11.0
3,American Samoa,0.200,0.055,NaN,12.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Andorra,0.470,0.079,NaN,13.8,94.0,NaN,NaN,NaN,NaN,NaN,NaN
5,Angola,1246.700,21.472,5783.0,57.5,19.1,44.1,13.9,2.4,51.9,64.5,NaN
6,Antigua and Barbuda,0.440,0.090,13342.0,75.4,63.4,16.5,6.1,7.1,75.8,NaN,NaN
7,Argentina,2736.690,41.446,14715.0,8.5,59.9,16.8,7.7,10.9,76.2,55.1,7.2
8,Armenia,28.470,2.977,3505.0,37.0,46.3,13.7,8.7,10.3,74.5,58.4,NaN
9,Aruba,0.180,0.103,NaN,57.9,78.9,10.3,8.4,11.3,75.3,NaN,NaN
10,Australia,7682.300,23.129,67463.0,10.8,83.0,13.2,6.3,14.3,82.2,70.5,5.2
11,Austria,82.409,8.480,50511.0,34.1,80.6,9.4,9.4,18.4,80.9,70.6,4.3
12,Azerbaijan,82.658,9.417,7812.0,45.9,58.7,18.3,5.8,5.6,70.7,68.1,5.2
13,"Bahamas, The",10.010,0.377,22312.0,17.3,72.0,15.3,6.1,7.7,75.1,76.4,14.0
14,Bahrain,0.760,1.332,24689.0,11.3,90.0,15.2,2.3,2.2,76.7,40.7,1.2
15,Bangladesh,130.170,156.595,958.0,67.2,6.5,20.0,5.7,4.8,70.7,60.4,NaN
16,Barbados,0.430,0.285,NaN,68.3,75.0,12.7,9.1,10.9,75.3,76.6,11.6
17,Belarus,202.910,9.466,7575.0,24.1,54.2,12.5,13.2,13.8,72.5,62.2,NaN
18,Belgium,30.280,11.183,46930.0,2.2,82.2,11.2,9.8,18.0,80.4,62.1,7.5
19,Belize,22.810,0.332,4894.0,55.7,31.7,23.4,4.5,4.0,73.9,51.9,14.4
20,Benin,112.760,10.323,805.0,56.9,4.9,36.4,9.5,2.9,59.3,68.9,NaN
21,Bermuda,0.050,0.065,NaN,0.0,95.3,10.4,6.8,NaN,80.6,NaN,8.4
22,Bhutan,38.117,0.754,2363.0,62.9,29.9,19.6,6.5,4.8,68.3,69.1,2.1
23,Bolivia,1083.300,10.671,2868.0,32.3,39.5,25.7,7.1,4.9,67.2,66.2,NaN
24,Bosnia and Herzegovina,51.000,3.829,4662.0,60.5,67.9,9.0,10.1,15.6,76.3,42.0,28.1
25,Botswana,566.730,2.021,7315.0,43.1,15.0,23.6,16.9,3.6,47.4,75.0,NaN
26,Brazil,8358.140,200.362,11208.0,14.8,51.6,14.9,6.5,7.5,73.9,65.0,NaN
27,Brunei Darussalam,5.270,0.418,38563.0,23.4,64.5,15.5,3.1,4.3,78.6,55.7,NaN
28,Bulgaria,108.560,7.265,7499.0,26.7,53.1,9.2,14.4,19.3,74.5,63.7,12.3
29,Burkina Faso,273.600,16.935,761.0,71.8,4.4,40.9,11.1,2.4,56.3,79.5,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
185,Sweden,407.340,9.600,60381.0,14.5,94.8,11.8,9.4,19.3,81.7,78.6,8.0
186,Switzerland,39.516,8.088,84748.0,26.2,86.7,10.2,8.0,17.7,82.7,78.0,4.2
187,Syrian Arab Republic,183.630,22.846,NaN,43.1,26.2,24.0,3.9,4.1,74.7,14.3,NaN
188,Tajikistan,139.960,8.208,1037.0,73.4,16.0,33.0,6.6,3.2,67.4,61.7,NaN
189,Tanzania,885.800,49.253,913.0,69.8,4.4,39.2,8.5,3.2,61.5,89.9,NaN
190,Thailand,510.890,67.011,5779.0,52.1,28.9,10.2,7.7,9.7,74.4,70.9,0.7
191,Timor-Leste,14.870,1.180,NaN,68.5,1.1,35.8,5.7,3.3,67.5,25.2,NaN
192,Togo,54.390,6.817,636.0,61.0,4.5,36.4,10.7,2.8,56.5,82.2,NaN
193,Tonga,0.720,0.105,4427.0,76.4,35.0,25.5,6.0,5.9,72.6,56.4,NaN
194,Trinidad and Tobago,5.130,1.341,18373.0,91.3,63.8,14.5,9.6,9.0,69.9,59.7,5.0
195,Tunisia,155.360,10.887,4317.0,33.5,43.8,19.8,6.3,7.2,73.6,27.3,17.6
196,Turkey,769.630,74.933,10972.0,27.6,46.3,16.8,5.7,7.4,75.2,32.2,9.2
197,Turkmenistan,469.930,5.240,7987.0,50.7,9.6,21.3,7.8,4.1,65.5,49.7,NaN
198,Turks and Caicos Islands,0.950,0.033,NaN,8.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
199,Tuvalu,0.030,0.010,3880.0,42.2,37.0,NaN,NaN,NaN,NaN,NaN,NaN
200,Uganda,199.810,37.579,657.0,84.6,16.2,43.2,9.2,2.4,59.2,76.6,NaN
201,Ukraine,579.320,45.490,3900.0,30.7,41.8,11.1,14.6,15.1,71.2,62.6,7.5
202,United Arab Emirates,83.600,9.346,43049.0,15.0,88.0,14.5,1.0,0.4,77.1,46.8,NaN
203,United Kingdom,241.930,64.107,41781.0,17.9,89.8,12.2,9.0,17.5,81.0,70.3,7.9
204,United States,9147.420,316.129,53042.0,18.7,84.2,12.5,8.2,14.0,78.8,66.1,8.1
205,Uruguay,175.020,3.407,16351.0,5.0,58.1,14.5,9.3,14.1,77.1,67.4,6.5
206,Uzbekistan,425.400,30.243,1878.0,63.8,38.2,22.5,4.8,4.3,68.2,51.0,NaN
207,Vanuatu,12.190,0.253,3277.0,74.5,11.3,26.6,4.8,3.9,71.7,62.3,NaN
208,"Venezuela, RB",882.050,30.405,14415.0,11.1,54.9,19.8,5.3,6.2,74.6,54.8,8.1
209,Vietnam,310.070,89.709,1911.0,67.7,43.9,15.5,5.7,6.6,75.8,78.9,1.8
210,Virgin Islands (U.S.),0.350,0.105,NaN,4.9,45.3,10.7,8.0,16.0,79.6,64.0,NaN
211,West Bank and Gaza,6.020,4.170,NaN,25.2,46.6,30.4,3.5,3.0,73.2,16.1,23.0
212,"Yemen, Rep.",527.970,24.407,1473.0,66.6,20.0,31.1,7.2,2.9,63.1,26.4,NaN
213,Zambia,743.390,14.539,1845.0,60.0,15.4,42.8,10.2,2.6,58.1,73.3,7.8
214,Zimbabwe,386.850,14.150,953.0,67.3,18.5,31.3,9.0,3.9,59.8,84.8,11.1

In [146]:
df.head() # by default first 5 rows

,Country,LandArea,Population,GDP,Rural,Internet,BirthRate,DeathRate,ElderlyPop,LifeExpectancy,FemaleLabor,Unemployment
0,Afghanistan,652.86,30.552,665.0,74.1,5.9,34.1,7.8,2.3,60.9,16.2,NaN
1,Albania,27.40,2.897,4460.0,44.6,60.1,12.9,6.9,10.7,77.5,51.7,13.4
2,Algeria,2381.74,39.208,5361.0,30.5,16.5,24.3,5.9,4.6,71.0,16.2,11.0
3,American Samoa,0.20,0.055,NaN,12.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Andorra,0.47,0.079,NaN,13.8,94.0,NaN,NaN,NaN,NaN,NaN,NaN

In [148]:
df.head(2)

,Country,LandArea,Population,GDP,Rural,Internet,BirthRate,DeathRate,ElderlyPop,LifeExpectancy,FemaleLabor,Unemployment
0,Afghanistan,652.86,30.552,665.0,74.1,5.9,34.1,7.8,2.3,60.9,16.2,NaN
1,Albania,27.40,2.897,4460.0,44.6,60.1,12.9,6.9,10.7,77.5,51.7,13.4

In [149]:
df['GDP']

0        665.0
1       4460.0
2       5361.0
3          NaN
4          NaN
5       5783.0
6      13342.0
7      14715.0
8       3505.0
9          NaN
10     67463.0
11     50511.0
12      7812.0
13     22312.0
14     24689.0
15       958.0
16         NaN
17      7575.0
18     46930.0
19      4894.0
20       805.0
21         NaN
22      2363.0
23      2868.0
24      4662.0
25      7315.0
26     11208.0
27     38563.0
28      7499.0
29       761.0
        ...
185    60381.0
186    84748.0
187        NaN
188     1037.0
189      913.0
190     5779.0
191        NaN
192      636.0
193     4427.0
194    18373.0
195     4317.0
196    10972.0
197     7987.0
198        NaN
199     3880.0
200      657.0
201     3900.0
202    43049.0
203    41781.0
204    53042.0
205    16351.0
206     1878.0
207     3277.0
208    14415.0
209     1911.0
210        NaN
211        NaN
212     1473.0
213     1845.0
214      953.0
Name: GDP, Length: 215, dtype: float64

In [150]:
df[['Country','GDP']]

                      Country      GDP
0                 Afghanistan    665.0
1                     Albania   4460.0
2                     Algeria   5361.0
3              American Samoa      NaN
4                     Andorra      NaN
5                      Angola   5783.0
6         Antigua and Barbuda  13342.0
7                   Argentina  14715.0
8                     Armenia   3505.0
9                       Aruba      NaN
10                  Australia  67463.0
11                    Austria  50511.0
12                 Azerbaijan   7812.0
13               Bahamas, The  22312.0
14                    Bahrain  24689.0
15                 Bangladesh    958.0
16                   Barbados      NaN
17                    Belarus   7575.0
18                    Belgium  46930.0
19                     Belize   4894.0
20                      Benin    805.0
21                    Bermuda      NaN
22                     Bhutan   2363.0
23                    Bolivia   2868.0
24     Bosnia and Herzegovina   4662.0
25                   Botswana   7315.0
26                     Brazil  11208.0
27          Brunei Darussalam  38563.0
28                   Bulgaria   7499.0
29               Burkina Faso    761.0
..                        ...      ...
185                    Sweden  60381.0
186               Switzerland  84748.0
187      Syrian Arab Republic      NaN
188                Tajikistan   1037.0
189                  Tanzania    913.0
190                  Thailand   5779.0
191               Timor-Leste      NaN
192                      Togo    636.0
193                     Tonga   4427.0
194       Trinidad and Tobago  18373.0
195                   Tunisia   4317.0
196                    Turkey  10972.0
197              Turkmenistan   7987.0
198  Turks and Caicos Islands      NaN
199                    Tuvalu   3880.0
200                    Uganda    657.0
201                   Ukraine   3900.0
202      United Arab Emirates  43049.0
203            United Kingdom  41781.0
204             United States  53042.0
205                   Uruguay  16351.0
206                Uzbekistan   1878.0
207                   Vanuatu   3277.0
208             Venezuela, RB  14415.0
209                   Vietnam   1911.0
210     Virgin Islands (U.S.)      NaN
211        West Bank and Gaza      NaN
212               Yemen, Rep.   1473.0
213                    Zambia   1845.0
214                  Zimbabwe    953.0

[215 rows x 2 columns]

In [151]:
df[['Country','GDP']].head()

          Country     GDP
0     Afghanistan   665.0
1         Albania  4460.0
2         Algeria  5361.0
3  American Samoa     NaN
4         Andorra     NaN

In [152]:
# reading non-csv file
df = pd.read_csv('anand.txt', sep='#')
df

   1  2  3  4
0  1  2  3  4
1  1  2  3  4
2  1  2  3  4

In [155]:
df = pd.read_csv('anand.txt', sep='#', header=None)
df

    0   1   2   3
0  10  20  30  40
1  10  20  30  40
2  10  20  30  40
3  10  20  30  40

In [158]:
df.to_csv('sujata.csv')

In [159]:
df.to_csv('sujata_without_rowindex.csv', index=None)

In [160]:
df.to_csv('sujata_1.csv', index=None, header=None)